koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/SPI_STM32F7xx.c
/*
 * Copyright (C) 2019-2023 Sergey Koshkin <koshkin.sergey@gmail.com>
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Project: SPI Driver for STMicroelectronics STM32F7xx
 */

/*******************************************************************************
 *  includes
 ******************************************************************************/

#include <stdbool.h>
#include "SPI_STM32F7xx.h"

#if defined(USE_SPI1) || defined(USE_SPI2) || defined(USE_SPI3) || \
    defined(USE_SPI4) || defined(USE_SPI5) || defined(USE_SPI6)

/*******************************************************************************
 *  defines and macros (scope: module-local)
 ******************************************************************************/

#define SPI_DRV_VERSION    DRIVER_VERSION_MAJOR_MINOR(1, 0) /* driver version */

/*******************************************************************************
 *  function prototypes (scope: module-local)
 ******************************************************************************/

#ifdef SPI_DMA_TX
static void SPIx_TX_DMA_Callback(uint32_t event, const void *param);
#endif

#ifdef SPI_DMA_RX
static void SPIx_RX_DMA_Callback(uint32_t event, const void *param);
#endif

/*******************************************************************************
 *  global variable definitions (scope: module-local)
 ******************************************************************************/

/* Driver Version */
static const DRIVER_VERSION DriverVersion = {
  SPI_API_VERSION,
  SPI_DRV_VERSION
};

/* Driver Capabilities */
static const SPI_CAPABILITIES DriverCapabilities = {
  0,  /* Simplex Mode (Master and Slave) */
  1,  /* TI Synchronous Serial Interface */
  0,  /* Microwire Interface */
  1,  /* Signal Mode Fault event: \ref SPI_EVENT_MODE_FAULT */
};

static const GPIO_PIN_CFG_t SPI_pin_cfg_af = {
    GPIO_MODE_AF_PP, GPIO_PULL_DISABLE, GPIO_SPEED_VERY_HIGH
};

static const GPIO_PIN_CFG_t SPI_pin_cfg_analog = {
    GPIO_MODE_ANALOG, GPIO_PULL_DISABLE, GPIO_SPEED_LOW
};

static const GPIO_PIN_CFG_t SPI_pin_cfg_out_pp = {
    GPIO_MODE_OUT_PP, GPIO_PULL_DISABLE, GPIO_SPEED_MEDIUM
};

#if defined(USE_SPI1)

/* SPI1 Information (Run-Time) */
static SPI_INFO          SPI1_Info;
static SPI_TRANSFER_INFO SPI1_TransferInfo;
static SPI_RESOURCES     SPI1_Resources;

#ifdef USE_SPI1_MISO_Pin
  static SPI_PIN SPI1_miso = {SPI1_MISO_GPIO_PORT, SPI1_MISO_GPIO_PIN, SPI1_MISO_GPIO_FUNC};
#endif

#ifdef USE_SPI1_MOSI_Pin
  static SPI_PIN SPI1_mosi = {SPI1_MOSI_GPIO_PORT, SPI1_MOSI_GPIO_PIN, SPI1_MOSI_GPIO_FUNC};
#endif

#ifdef USE_SPI1_SCK_Pin
  static SPI_PIN SPI1_sck = {SPI1_SCK_GPIO_PORT, SPI1_SCK_GPIO_PIN, SPI1_SCK_GPIO_FUNC};
#endif

#ifdef USE_SPI1_NSS_Pin
  static SPI_PIN SPI1_nss = {SPI1_NSS_GPIO_PORT, SPI1_NSS_GPIO_PIN, SPI1_NSS_GPIO_FUNC};
#endif

#ifdef SPI1_TX_DMA_Stream
static DMA_Handle_t SPI1_TX_DMA_Handle;
static const DMA_Resources_t SPI1_TX_DMA = {
  &SPI1_TX_DMA_Handle,
  SPI1_TX_DMA_Stream,
  SPI1_TX_DMA_Channel,
  SPI1_TX_DMA_Priority,
  SPIx_TX_DMA_Callback,
  &SPI1_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI1_TX_DMA_IRQn,
};
#endif

#ifdef SPI1_RX_DMA_Stream
static DMA_Handle_t SPI1_RX_DMA_Handle;
static const DMA_Resources_t SPI1_RX_DMA = {
  &SPI1_RX_DMA_Handle,
  SPI1_RX_DMA_Stream,
  SPI1_RX_DMA_Channel,
  SPI1_RX_DMA_Priority,
  SPIx_RX_DMA_Callback,
  &SPI1_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI1_RX_DMA_IRQn,
};
#endif

/* SPI1 Resources */
static SPI_RESOURCES SPI1_Resources = {
  SPI1,
  {
#ifdef USE_SPI1_MISO_Pin
      &SPI1_miso,
#else
      NULL,
#endif
#ifdef USE_SPI1_MOSI_Pin
      &SPI1_mosi,
#else
      NULL,
#endif
#ifdef USE_SPI1_SCK_Pin
      &SPI1_sck,
#else
      NULL,
#endif
#ifdef USE_SPI1_NSS_Pin
      &SPI1_nss,
#else
      NULL,
#endif
  },
  RCC_PERIPH_SPI1,
#ifdef SPI1_TX_DMA_Stream
  &SPI1_TX_DMA,
#else
  NULL,
#endif
#ifdef SPI1_RX_DMA_Stream
  &SPI1_RX_DMA,
#else
  NULL,
#endif
  &SPI1_Info,
  &SPI1_TransferInfo,
  SPI1_IRQn
};

#endif /* USE_SPI1 */

#if defined(USE_SPI2)

/* SPI2 Information (Run-Time) */
static SPI_INFO          SPI2_Info;
static SPI_TRANSFER_INFO SPI2_TransferInfo;
static SPI_RESOURCES     SPI2_Resources;

#ifdef USE_SPI2_MISO_Pin
  static SPI_PIN SPI2_miso = {SPI2_MISO_GPIO_PORT, SPI2_MISO_GPIO_PIN, SPI2_MISO_GPIO_FUNC};
#endif

#ifdef USE_SPI2_MOSI_Pin
  static SPI_PIN SPI2_mosi = {SPI2_MOSI_GPIO_PORT, SPI2_MOSI_GPIO_PIN, SPI2_MOSI_GPIO_FUNC};
#endif

#ifdef USE_SPI2_SCK_Pin
  static SPI_PIN SPI2_sck = {SPI2_SCK_GPIO_PORT, SPI2_SCK_GPIO_PIN, SPI2_SCK_GPIO_FUNC};
#endif

#ifdef USE_SPI2_NSS_Pin
  static SPI_PIN SPI2_nss = {SPI2_NSS_GPIO_PORT, SPI2_NSS_GPIO_PIN, SPI2_NSS_GPIO_FUNC};
#endif

#ifdef SPI2_TX_DMA_Stream
static DMA_Handle_t SPI2_TX_DMA_Handle;
static DMA_Resources_t SPI2_TX_DMA = {
  &SPI2_TX_DMA_Handle,
  SPI2_TX_DMA_Stream,
  SPI2_TX_DMA_Channel,
  SPI2_TX_DMA_Priority,
  SPIx_TX_DMA_Callback,
  &SPI2_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI2_TX_DMA_IRQn,
};
#endif

#ifdef SPI2_RX_DMA_Stream
static DMA_Handle_t SPI2_RX_DMA_Handle;
static DMA_Resources_t SPI2_RX_DMA = {
  &SPI2_RX_DMA_Handle,
  SPI2_RX_DMA_Stream,
  SPI2_RX_DMA_Channel,
  SPI2_RX_DMA_Priority,
  SPIx_RX_DMA_Callback,
  &SPI2_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI2_RX_DMA_IRQn,
};
#endif

/* SPI2 Resources */
static SPI_RESOURCES SPI2_Resources = {
  SPI2,
  {
#ifdef USE_SPI2_MISO_Pin
      &SPI2_miso,
#else
      NULL,
#endif
#ifdef USE_SPI2_MOSI_Pin
      &SPI2_mosi,
#else
      NULL,
#endif
#ifdef USE_SPI2_SCK_Pin
      &SPI2_sck,
#else
      NULL,
#endif
#ifdef USE_SPI2_NSS_Pin
      &SPI2_nss,
#else
      NULL,
#endif
  },
  RCC_PERIPH_SPI2,
#ifdef SPI2_TX_DMA_Stream
  &SPI2_TX_DMA,
#else
  NULL,
#endif
#ifdef SPI2_RX_DMA_Stream
  &SPI2_RX_DMA,
#else
  NULL,
#endif
  &SPI2_Info,
  &SPI2_TransferInfo,
  SPI2_IRQn
};

