koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/SPI_STM32F7xx.c
#endif /* USE_SPI2 */

#if defined(USE_SPI3)

/* SPI3 Information (Run-Time) */
static SPI_INFO          SPI3_Info;
static SPI_TRANSFER_INFO SPI3_TransferInfo;
static SPI_RESOURCES     SPI3_Resources;

#ifdef USE_SPI3_MISO_Pin
  static SPI_PIN SPI3_miso = {SPI3_MISO_GPIO_PORT, SPI3_MISO_GPIO_PIN, SPI3_MISO_GPIO_FUNC};
#endif

#ifdef USE_SPI3_MOSI_Pin
  static SPI_PIN SPI3_mosi = {SPI3_MOSI_GPIO_PORT, SPI3_MOSI_GPIO_PIN, SPI3_MOSI_GPIO_FUNC};
#endif

#ifdef USE_SPI3_SCK_Pin
  static SPI_PIN SPI3_sck = {SPI3_SCK_GPIO_PORT, SPI3_SCK_GPIO_PIN, SPI3_SCK_GPIO_FUNC};
#endif

#ifdef USE_SPI3_NSS_Pin
  static SPI_PIN SPI3_nss = {SPI3_NSS_GPIO_PORT, SPI3_NSS_GPIO_PIN, SPI3_NSS_GPIO_FUNC};
#endif

#ifdef SPI3_TX_DMA_Stream
static DMA_Handle_t SPI3_TX_DMA_Handle;
static DMA_Resources_t SPI3_TX_DMA = {
  &SPI3_TX_DMA_Handle,
  SPI3_TX_DMA_Stream,
  SPI3_TX_DMA_Channel,
  SPI3_TX_DMA_Priority,
  SPIx_TX_DMA_Callback,
  &SPI3_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI3_TX_DMA_IRQn,
};
#endif

#ifdef SPI3_RX_DMA_Stream
static DMA_Handle_t SPI3_RX_DMA_Handle;
static DMA_Resources_t SPI3_RX_DMA = {
  &SPI3_RX_DMA_Handle,
  SPI3_RX_DMA_Stream,
  SPI3_RX_DMA_Channel,
  SPI3_RX_DMA_Priority,
  SPIx_RX_DMA_Callback,
  &SPI3_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI3_RX_DMA_IRQn,
};
#endif

/* SPI3 Resources */
static SPI_RESOURCES SPI3_Resources = {
  SPI3,
  {
#ifdef USE_SPI3_MISO_Pin
      &SPI3_miso,
#else
      NULL,
#endif
#ifdef USE_SPI3_MOSI_Pin
      &SPI3_mosi,
#else
      NULL,
#endif
#ifdef USE_SPI3_SCK_Pin
      &SPI3_sck,
#else
      NULL,
#endif
#ifdef USE_SPI3_NSS_Pin
      &SPI3_nss,
#else
      NULL,
#endif
  },
  RCC_PERIPH_SPI3,
#ifdef SPI3_TX_DMA_Stream
  &SPI3_TX_DMA,
#else
  NULL,
#endif
#ifdef SPI3_RX_DMA_Stream
  &SPI3_RX_DMA,
#else
  NULL,
#endif
  &SPI3_Info,
  &SPI3_TransferInfo,
  SPI3_IRQn
};

#endif /* USE_SPI3 */

#if defined(USE_SPI4)

/* SPI4 Information (Run-Time) */
static SPI_INFO          SPI4_Info;
static SPI_TRANSFER_INFO SPI4_TransferInfo;
static SPI_RESOURCES     SPI4_Resources;

#ifdef USE_SPI4_MISO_Pin
  static SPI_PIN SPI4_miso = {SPI4_MISO_GPIO_PORT, SPI4_MISO_GPIO_PIN, SPI4_MISO_GPIO_FUNC};
#endif

#ifdef USE_SPI4_MOSI_Pin
  static SPI_PIN SPI4_mosi = {SPI4_MOSI_GPIO_PORT, SPI4_MOSI_GPIO_PIN, SPI4_MOSI_GPIO_FUNC};
#endif

#ifdef USE_SPI4_SCK_Pin
  static SPI_PIN SPI4_sck = {SPI4_SCK_GPIO_PORT, SPI4_SCK_GPIO_PIN, SPI4_SCK_GPIO_FUNC};
#endif

#ifdef USE_SPI4_NSS_Pin
  static SPI_PIN SPI4_nss = {SPI4_NSS_GPIO_PORT, SPI4_NSS_GPIO_PIN, SPI4_NSS_GPIO_FUNC};
#endif

#ifdef SPI4_TX_DMA_Stream
static DMA_Handle_t SPI4_TX_DMA_Handle;
static DMA_Resources_t SPI4_TX_DMA = {
  &SPI4_TX_DMA_Handle,
  SPI4_TX_DMA_Stream,
  SPI4_TX_DMA_Channel,
  SPI4_TX_DMA_Priority,
  SPIx_TX_DMA_Callback,
  &SPI4_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI4_TX_DMA_IRQn,
};
#endif

#ifdef SPI4_RX_DMA_Stream
static DMA_Handle_t SPI4_RX_DMA_Handle;
static DMA_Resources_t SPI4_RX_DMA = {
  &SPI4_RX_DMA_Handle,
  SPI4_RX_DMA_Stream,
  SPI4_RX_DMA_Channel,
  SPI4_RX_DMA_Priority,
  SPIx_RX_DMA_Callback,
  &SPI4_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI4_RX_DMA_IRQn,
};
#endif

/* SPI4 Resources */
static SPI_RESOURCES SPI4_Resources = {
  SPI4,
  {
#ifdef USE_SPI4_MISO_Pin
      &SPI4_miso,
#else
      NULL,
#endif
#ifdef USE_SPI4_MOSI_Pin
      &SPI4_mosi,
#else
      NULL,
#endif
#ifdef USE_SPI4_SCK_Pin
      &SPI4_sck,
#else
      NULL,
#endif
#ifdef USE_SPI4_NSS_Pin
      &SPI4_nss,
#else
      NULL,
#endif
  },
  RCC_PERIPH_SPI4,
#ifdef SPI4_TX_DMA_Stream
  &SPI4_TX_DMA,
#else
  NULL,
#endif
#ifdef SPI4_RX_DMA_Stream
  &SPI4_RX_DMA,
#else
  NULL,
#endif
  &SPI4_Info,
  &SPI4_TransferInfo,
  SPI4_IRQn
};

#endif /* USE_SPI4 */

#if defined(USE_SPI5)

/* SPI5 Information (Run-Time) */
static SPI_INFO          SPI5_Info;
static SPI_TRANSFER_INFO SPI5_TransferInfo;
static SPI_RESOURCES     SPI5_Resources;

#ifdef USE_SPI5_MISO_Pin
  static SPI_PIN SPI5_miso = {SPI5_MISO_GPIO_PORT, SPI5_MISO_GPIO_PIN, SPI5_MISO_GPIO_FUNC};
#endif

#ifdef USE_SPI5_MOSI_Pin
  static SPI_PIN SPI5_mosi = {SPI5_MOSI_GPIO_PORT, SPI5_MOSI_GPIO_PIN, SPI5_MOSI_GPIO_FUNC};
#endif

#ifdef USE_SPI5_SCK_Pin
  static SPI_PIN SPI5_sck = {SPI5_SCK_GPIO_PORT, SPI5_SCK_GPIO_PIN, SPI5_SCK_GPIO_FUNC};
#endif

#ifdef USE_SPI5_NSS_Pin
  static SPI_PIN SPI5_nss = {SPI5_NSS_GPIO_PORT, SPI5_NSS_GPIO_PIN, SPI5_NSS_GPIO_FUNC};
#endif

#ifdef SPI5_TX_DMA_Stream
static DMA_Handle_t SPI5_TX_DMA_Handle;
static DMA_Resources_t SPI5_TX_DMA = {
  &SPI5_TX_DMA_Handle,
  SPI5_TX_DMA_Stream,
  SPI5_TX_DMA_Channel,
  SPI5_TX_DMA_Priority,
  SPIx_TX_DMA_Callback,
  &SPI5_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI5_TX_DMA_IRQn,
};
#endif

#ifdef SPI5_RX_DMA_Stream
static DMA_Handle_t SPI5_RX_DMA_Handle;
static DMA_Resources_t SPI5_RX_DMA = {
  &SPI5_RX_DMA_Handle,
  SPI5_RX_DMA_Stream,
  SPI5_RX_DMA_Channel,
  SPI5_RX_DMA_Priority,
  SPIx_RX_DMA_Callback,
  &SPI5_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI5_RX_DMA_IRQn,
};
#endif

/* SPI5 Resources */
static SPI_RESOURCES SPI5_Resources = {
  SPI5,
  {
#ifdef USE_SPI5_MISO_Pin
      &SPI5_miso,
#else
      NULL,
#endif
#ifdef USE_SPI5_MOSI_Pin
      &SPI5_mosi,
#else
      NULL,
#endif
#ifdef USE_SPI5_SCK_Pin
      &SPI5_sck,
#else
      NULL,
#endif
#ifdef USE_SPI5_NSS_Pin
      &SPI5_nss,
#else
      NULL,
#endif
  },
  RCC_PERIPH_SPI5,
#ifdef SPI5_TX_DMA_Stream
  &SPI5_TX_DMA,
#else
  NULL,
#endif
#ifdef SPI5_RX_DMA_Stream
  &SPI5_RX_DMA,
#else
  NULL,
#endif
  &SPI5_Info,
  &SPI5_TransferInfo,
  SPI5_IRQn
};

#endif /* USE_SPI5 */

#if defined(USE_SPI6)

/* SPI6 Information (Run-Time) */
static SPI_INFO          SPI6_Info;
static SPI_TRANSFER_INFO SPI6_TransferInfo;
static SPI_RESOURCES     SPI6_Resources;

#ifdef USE_SPI6_MISO_Pin
  static SPI_PIN SPI6_miso = {SPI6_MISO_GPIO_PORT, SPI6_MISO_GPIO_PIN, SPI6_MISO_GPIO_FUNC};
#endif

#ifdef USE_SPI6_MOSI_Pin
  static SPI_PIN SPI6_mosi = {SPI6_MOSI_GPIO_PORT, SPI6_MOSI_GPIO_PIN, SPI6_MOSI_GPIO_FUNC};
#endif

#ifdef USE_SPI6_SCK_Pin
  static SPI_PIN SPI6_sck = {SPI6_SCK_GPIO_PORT, SPI6_SCK_GPIO_PIN, SPI6_SCK_GPIO_FUNC};
#endif

#ifdef USE_SPI6_NSS_Pin
  static SPI_PIN SPI6_nss = {SPI6_NSS_GPIO_PORT, SPI6_NSS_GPIO_PIN, SPI6_NSS_GPIO_FUNC};
#endif

#ifdef SPI6_TX_DMA_Stream
static DMA_Handle_t SPI6_TX_DMA_Handle;
static DMA_Resources_t SPI6_TX_DMA = {
  &SPI6_TX_DMA_Handle,
  SPI6_TX_DMA_Stream,
  SPI6_TX_DMA_Channel,
  SPI6_TX_DMA_Priority,
  SPIx_TX_DMA_Callback,
  &SPI6_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI6_TX_DMA_IRQn,
};
#endif

#ifdef SPI6_RX_DMA_Stream
static DMA_Handle_t SPI6_RX_DMA_Handle;
static DMA_Resources_t SPI6_RX_DMA = {
  &SPI6_RX_DMA_Handle,
  SPI6_RX_DMA_Stream,
  SPI6_RX_DMA_Channel,
  SPI6_RX_DMA_Priority,
  SPIx_RX_DMA_Callback,
  &SPI6_Resources,
  DEV_SPI_DMA_INT_PRIORITY,
  SPI6_RX_DMA_IRQn,
};
#endif

