koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/SPI_STM32F7xx.c
/* SPI6 Resources */
static SPI_RESOURCES SPI6_Resources = {
  SPI6,
  {
#ifdef USE_SPI6_MISO_Pin
      &SPI6_miso,
#else
      NULL,
#endif
#ifdef USE_SPI6_MOSI_Pin
      &SPI6_mosi,
#else
      NULL,
#endif
#ifdef USE_SPI6_SCK_Pin
      &SPI6_sck,
#else
      NULL,
#endif
#ifdef USE_SPI6_NSS_Pin
      &SPI6_nss,
#else
      NULL,
#endif
  },
  RCC_PERIPH_SPI6,
#ifdef SPI6_TX_DMA_Stream
  &SPI6_TX_DMA,
#else
  NULL,
#endif
#ifdef SPI6_RX_DMA_Stream
  &SPI6_RX_DMA,
#else
  NULL,
#endif
  &SPI6_Info,
  &SPI6_TransferInfo,
  SPI6_IRQn
};

#endif /* USE_SPI6 */

/*******************************************************************************
 *  function implementations (scope: module-local)
 ******************************************************************************/

/**
 * @fn          void PinConfig(const SPI_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
 * @brief       Configure Pin
 * @param[in]   io       Pointer to SPI_PIN
 * @param[in]   pin_cfg  Pointer to GPIO_PIN_CFG_t
 */
static
void PinConfig(const SPI_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
{
  if ((io == NULL) || (pin_cfg == NULL))
    return;

  if (GPIO_GetPortClockState(io->port) == false)
    GPIO_PortClock(io->port, GPIO_PORT_CLK_ENABLE);

  if (pin_cfg->mode == GPIO_MODE_AF_PP || pin_cfg->mode == GPIO_MODE_AF_OD)
    GPIO_AFConfig(io->port, io->pin, io->func);

  GPIO_PinConfig(io->port, io->pin, pin_cfg);
}

/**
 *
 * @return
 */
int32_t CalcPrescalerValue(SPI_RESOURCES *spi, uint32_t freq)
{
  int32_t val;

  uint32_t pclk = RCC_GetPeriphFreq(spi->rcc);
  for (val = 0; val < 8; val++) {
    if (freq >= (pclk >> (val + 1)))
      break;
  }

  if ((val == 8) || (freq < (pclk >> (val + 1)))) {
    // Requested Bus Speed can not be configured
    val = -1;
  }

  return (val);
}

/**
 * @fn          DRIVER_VERSION SPIx_GetVersion(void)
 * @brief       Get driver version.
 * @return      \ref DRIVER_VERSION
 */
static
DRIVER_VERSION SPIx_GetVersion(void)
{
  return DriverVersion;
}

/**
 * @fn          SPI_CAPABILITIES SPIx_GetCapabilities(void)
 * @brief       Get driver capabilities.
 * @return      \ref SPI_CAPABILITIES
 */
static
SPI_CAPABILITIES SPIx_GetCapabilities(void)
{
  return DriverCapabilities;
}

/**
 * @fn          int32_t SPI_Initialize(SPI_SignalEvent_t cb_event, SPI_RESOURCES *spi)
 * @brief       Initialize SPI Interface.
 * @param[in]   cb_event  Pointer to \ref SPI_SignalEvent
 * @param[in]   spi       Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Initialize(SPI_SignalEvent_t cb_event, SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;

  if (info->state & SPI_INITIALIZED)
    return DRIVER_OK;

  /* Initialize SPI Run-Time Resources */
  info->cb_event          = cb_event;
  info->status.busy       = 0U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;
  info->mode              = 0U;

  /* Clear transfer information */
  memset((void *)spi->xfer, 0, sizeof(SPI_TRANSFER_INFO));

  SPI_IO *io = &spi->io;
  const GPIO_PIN_CFG_t *pin_cfg = &SPI_pin_cfg_af;

  /* Configure MISO Pin */
  PinConfig(io->miso, pin_cfg);
  /* Configure MOSI Pin */
  PinConfig(io->mosi, pin_cfg);
  /* Configure SCK Pin */
  PinConfig(io->sck, pin_cfg);
  /* Configure NSS Pin */
  PinConfig(io->nss, pin_cfg);

  info->state = SPI_INITIALIZED;

  return DRIVER_OK;
}

/**
 * @fn          int32_t SPI_Uninitialize(SPI_RESOURCES *spi)
 * @brief       De-initialize SPI Interface.
 * @param[in]   spi  Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Uninitialize(SPI_RESOURCES *spi)
{
  SPI_IO *io = &spi->io;
  const GPIO_PIN_CFG_t *pin_cfg = &SPI_pin_cfg_analog;

  /* Unconfigure MISO Pin */
  PinConfig(io->miso, pin_cfg);
  /* Unconfigure MOSI Pin */
  PinConfig(io->mosi, pin_cfg);
  /* Unconfigure SCK Pin */
  PinConfig(io->sck, pin_cfg);
  /* Unconfigure NSS Pin */
  PinConfig(io->nss, pin_cfg);

  /* Clear SPI state */
  spi->info->state = 0U;

  return DRIVER_OK;
}

/**
 * @fn          int32_t SPI_PowerControl(POWER_STATE state, SPI_RESOURCES *spi)
 * @brief       Control SPI Interface Power.
 * @param[in]   state  Power state
 * @param[in]   spi    Pointer to SPI resources
 * @return      \ref  execution_status
 */
static
int32_t SPI_PowerControl(POWER_STATE state, SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;

  switch (state) {
    case POWER_OFF:
      /* SPI peripheral reset */
      RCC_ResetPeriph(spi->rcc);
      /* Disable SPI IRQ */
      NVIC_DisableIRQ(spi->irq_num);

      /* Uninitialize DMA */
#ifdef SPI_DMA
      if (spi->tx_dma != NULL)
        DMA_Uninitialize(spi->tx_dma);

      if (spi->rx_dma != NULL)
        DMA_Uninitialize(spi->rx_dma);
#endif

      /* Disable peripheral clock */
      RCC_DisablePeriph(spi->rcc);

      /* Clear status flags */
      info->status.busy       = 0U;
      info->status.data_lost  = 0U;
      info->status.mode_fault = 0U;

      /* Clear powered flag */
      info->state &= ~SPI_POWERED;
      break;

    case POWER_FULL:
      if ((info->state & SPI_INITIALIZED) == 0U)
        return DRIVER_ERROR;

      if ((info->state & SPI_POWERED) != 0U)
        return DRIVER_OK;

      /* Clear status flags */
      info->status.busy       = 0U;
      info->status.data_lost  = 0U;
      info->status.mode_fault = 0U;

      spi->xfer->def_val      = 0U;

      /* Ready for operation - set powered flag */
      info->state |= SPI_POWERED;

      /* Enable the peripheral clock */
      RCC_EnablePeriph(spi->rcc);

      /* Clear and Enable SPI IRQ */
      NVIC_ClearPendingIRQ(spi->irq_num);
      NVIC_SetPriority(spi->irq_num, DEV_SPI_INT_PRIORITY);
      NVIC_EnableIRQ(spi->irq_num);

      /* Initialize DMA */
#ifdef SPI_DMA
      if (spi->tx_dma != NULL) {
        DMA_StreamConfig_t *cfg = &spi->tx_dma->handle->config;

        cfg->Direction = DMA_DIR_MEM_TO_PER;
        cfg->Mode      = DMA_MODE_NORMAL;
        cfg->FIFOMode  = DMA_FIFOMODE_DISABLE;
        cfg->MemBurst  = DMA_MBURST_SINGLE;
        cfg->PerBurst  = DMA_PBURST_SINGLE;

        DMA_Initialize(spi->tx_dma);
      }

      if (spi->rx_dma != NULL) {
        DMA_StreamConfig_t *cfg = &spi->rx_dma->handle->config;

        cfg->Direction = DMA_DIR_PER_TO_MEM;
        cfg->Mode      = DMA_MODE_NORMAL;
        cfg->FIFOMode  = DMA_FIFOMODE_DISABLE;
        cfg->MemBurst  = DMA_MBURST_SINGLE;
        cfg->PerBurst  = DMA_PBURST_SINGLE;

