koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/SPI_STM32F7xx.c
        DMA_Initialize(spi->rx_dma);
      }
#endif

      /* Reset the peripheral */
      RCC_ResetPeriph(spi->rcc);
      break;

    default:
      return DRIVER_ERROR_UNSUPPORTED;
  }

  return DRIVER_OK;
}

/**
 * @fn          int32_t SPI_Send(const void *data, uint32_t num, SPI_RESOURCES *spi)
 * @brief       Start sending data to SPI transmitter.
 * @param[in]   data  Pointer to buffer with data to send to SPI transmitter
 * @param[in]   num   Number of data items to send
 * @param[in]   spi   Pointer to SPI resources
 * @return      \ref  execution_status
 */
static
int32_t SPI_Send(const void *data, uint32_t num, SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;
  SPI_TRANSFER_INFO *xfer = spi->xfer;
  SPI_TypeDef *reg = spi->reg;
  uint32_t cr2;

  if ((data == NULL) || (num == 0U)) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->state & SPI_CONFIGURED) == 0U) {
    return (DRIVER_ERROR);
  }

  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  cr2 = reg->CR2;
#if defined(SPI_DMA_RX) || defined(SPI_DMA_TX)
  bool access_16bit = ((cr2 & SPI_CR2_DS) >> SPI_CR2_DS_Pos) > 7U;
#endif

  /* Update SPI statuses */
  info->status.busy       = 1U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;

  /* Save transfer info */
  xfer->rx_buf = NULL;
  xfer->tx_buf = data;
  xfer->num    = num;
  xfer->rx_cnt = 0U;
  xfer->tx_cnt = 0U;

#ifdef SPI_DMA_RX
  /* DMA mode */
  if (spi->rx_dma != NULL) {
    /* Prepare DMA to receive dummy RX data */
    DMA_StreamConfig_t *cfg = &spi->rx_dma->handle->config;

    cfg->MemInc = DMA_MINC_DISABLE;
    cfg->PerInc = DMA_PINC_DISABLE;

    if (access_16bit) {
      /* 16 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_HALFWORD;
      cfg->PerDataAlign = DMA_PDATAALIGN_HALFWORD;
    }
    else {
      /* 8 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
      cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
    }

    /* Initialize and start DMA Stream */
    DMA_Config(spi->rx_dma);
    DMA_Start(spi->rx_dma, (uint32_t)&reg->DR, (uint32_t)&xfer->dump_val, num);
    /* RX Buffer DMA enable */
    cr2 |= SPI_CR2_RXDMAEN;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* RX Buffer not empty interrupt enable */
    cr2 |= SPI_CR2_RXNEIE;
  }

#ifdef SPI_DMA_TX
  /* DMA mode */
  if (spi->tx_dma != NULL) {
    /* Prepare DMA to send TX data */
    DMA_StreamConfig_t *cfg = &spi->tx_dma->handle->config;

    cfg->MemInc = DMA_MINC_ENABLE;
    cfg->PerInc = DMA_PINC_DISABLE;

    if (access_16bit) {
      /* 16 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_HALFWORD;
      cfg->PerDataAlign = DMA_PDATAALIGN_HALFWORD;
    }
    else {
      /* 8 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
      cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
    }

    /* Initialize and start DMA Stream */
    DMA_Config(spi->tx_dma);
    DMA_Start(spi->tx_dma, (uint32_t)&reg->DR, (uint32_t)data, num);
    /* TX Buffer DMA enable */
    cr2 |= SPI_CR2_TXDMAEN;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* TX Buffer empty interrupt enable */
    cr2 |= SPI_CR2_TXEIE;
  }

  reg->CR2 = cr2;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t SPI_Receive(void *data, uint32_t num, SPI_RESOURCES *spi)
 * @brief       Start receiving data from SPI receiver.
 * @param[out]  data  Pointer to buffer for data to receive from SPI receiver
 * @param[in]   num   Number of data items to receive
 * @param[in]   spi   Pointer to SPI resources
 * @return      \ref  execution_status
 */
static
int32_t SPI_Receive(void *data, uint32_t num, SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;
  SPI_TRANSFER_INFO *xfer = spi->xfer;
  SPI_TypeDef *reg = spi->reg;
  uint32_t cr2;

  if ((data == NULL) || (num == 0U)) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->state & SPI_CONFIGURED) == 0U) {
    return (DRIVER_ERROR);
  }

  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  cr2 = reg->CR2;
#if defined(SPI_DMA_RX) || defined(SPI_DMA_TX)
  bool access_16bit = ((cr2 & SPI_CR2_DS) >> SPI_CR2_DS_Pos) > 7U;
#endif

  /* Update SPI statuses */
  info->status.busy       = 1U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;

  /* Save transfer info */
  xfer->rx_buf = data;
  xfer->tx_buf = NULL;
  xfer->num    = num;
  xfer->rx_cnt = 0U;
  xfer->tx_cnt = 0U;

#ifdef SPI_DMA_RX
  /* DMA mode */
  if (spi->rx_dma != NULL) {
    /* Prepare DMA to receive RX data */
    DMA_StreamConfig_t *cfg = &spi->rx_dma->handle->config;

    cfg->MemInc = DMA_MINC_ENABLE;
    cfg->PerInc = DMA_PINC_DISABLE;

    if (access_16bit) {
      /* 16 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_HALFWORD;
      cfg->PerDataAlign = DMA_PDATAALIGN_HALFWORD;
    }
    else {
      /* 8 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
      cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
    }

    /* Initialize and start DMA Stream */
    DMA_Config(spi->rx_dma);
    DMA_Start(spi->rx_dma, (uint32_t)&reg->DR, (uint32_t)data, num);
    /* RX Buffer DMA enable */
    cr2 |= SPI_CR2_RXDMAEN;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* RX Buffer not empty interrupt enable */
    cr2 |= SPI_CR2_RXNEIE;
  }

#ifdef SPI_DMA_TX
  /* DMA mode */
  if (spi->tx_dma != NULL) {
    /* Prepare DMA to send TX data */
    DMA_StreamConfig_t *cfg = &spi->tx_dma->handle->config;

    cfg->MemInc = DMA_MINC_DISABLE;
    cfg->PerInc = DMA_PINC_DISABLE;

    if (access_16bit) {
      /* 16 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_HALFWORD;
      cfg->PerDataAlign = DMA_PDATAALIGN_HALFWORD;
    }
    else {
      /* 8 - bit data frame */
      cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
      cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
    }

    /* Initialize and start DMA Stream */
    DMA_Config(spi->tx_dma);
    DMA_Start(spi->tx_dma, (uint32_t)&reg->DR, (uint32_t)&xfer->def_val, num);
    /* TX Buffer DMA enable */
    cr2 |= SPI_CR2_TXDMAEN;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* TX Buffer empty interrupt enable */
    cr2 |= SPI_CR2_TXEIE;
  }

  reg->CR2 = cr2;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t SPI_Transfer(const void *data_out, void *data_in, uint32_t num, SPI_RESOURCES *spi)
 * @brief       Start sending/receiving data to/from SPI transmitter/receiver.
 * @param[in]   data_out  Pointer to buffer with data to send to SPI transmitter
 * @param[out]  data_in   Pointer to buffer for data to receive from SPI receiver
 * @param[in]   num       Number of data items to transfer
 * @param[in]   spi       Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Transfer(const void *data_out, void *data_in, uint32_t num, SPI_RESOURCES *spi)
{
  SPI_INFO *info = spi->info;
  SPI_TRANSFER_INFO *xfer = spi->xfer;
  SPI_TypeDef *reg = spi->reg;
  uint32_t cr2;

  if ((data_out == NULL) || (data_in == NULL) || (num == 0U)) {
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->state & SPI_CONFIGURED) == 0U) {
    return (DRIVER_ERROR);
  }

