koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/SPI_STM32F7xx.c
  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  cr2 = reg->CR2;
#ifdef SPI_DMA
  bool access_16bit = ((cr2 & SPI_CR2_DS) >> SPI_CR2_DS_Pos) > 7U;
#endif

  /* Update SPI statuses */
  info->status.busy       = 1U;
  info->status.data_lost  = 0U;
  info->status.mode_fault = 0U;

  /* Save transfer info */
  xfer->rx_buf = data_in;
  xfer->tx_buf = data_out;
  xfer->num    = num;
  xfer->rx_cnt = 0U;
  xfer->tx_cnt = 0U;

#ifdef SPI_DMA
  if ((spi->rx_dma != NULL) || (spi->tx_dma != NULL)) {
    /* DMA mode */
    if (spi->rx_dma != NULL) {
      /* Prepare DMA to receive dummy RX data */
      DMA_StreamConfig_t *cfg = &spi->rx_dma->handle->config;

      cfg->MemInc = DMA_MINC_ENABLE;
      cfg->PerInc = DMA_PINC_DISABLE;

      if (access_16bit) {
        /* 16 - bit data frame */
        cfg->MemDataAlign = DMA_MDATAALIGN_HALFWORD;
        cfg->PerDataAlign = DMA_PDATAALIGN_HALFWORD;
      }
      else {
        /* 8 - bit data frame */
        cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
        cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
      }

      /* Initialize and start DMA Stream */
      DMA_Config(spi->rx_dma);
      DMA_Start(spi->rx_dma, (uint32_t)&reg->DR, (uint32_t)data_in, num);
      /* RX Buffer DMA enable */
      cr2 |= SPI_CR2_RXDMAEN;
    }

    if (spi->tx_dma != NULL) {
      /* Prepare DMA to send TX data */
      DMA_StreamConfig_t *cfg = &spi->tx_dma->handle->config;

      cfg->MemInc = DMA_MINC_ENABLE;
      cfg->PerInc = DMA_PINC_DISABLE;

      if (access_16bit) {
        /* 16 - bit data frame */
        cfg->MemDataAlign = DMA_MDATAALIGN_HALFWORD;
        cfg->PerDataAlign = DMA_PDATAALIGN_HALFWORD;
      }
      else {
        /* 8 - bit data frame */
        cfg->MemDataAlign = DMA_MDATAALIGN_BYTE;
        cfg->PerDataAlign = DMA_PDATAALIGN_BYTE;
      }

      /* Initialize and start DMA Stream */
      DMA_Config(spi->tx_dma);
      DMA_Start(spi->tx_dma, (uint32_t)&reg->DR, (uint32_t)data_out, num);
      /* TX Buffer DMA enable */
      cr2 |= SPI_CR2_TXDMAEN;
    }
  }
  else
#endif
  {
    /* Interrupt mode */
    /* RX Buffer not empty interrupt enable */
    cr2 |= SPI_CR2_RXNEIE | SPI_CR2_TXEIE;
  }

  reg->CR2 = cr2;

  return (DRIVER_OK);
}

/**
 * @fn          uint32_t SPI_GetDataCount(SPI_RESOURCES *spi)
 * @brief       Get transferred data count.
 * @param[in]   spi  Pointer to SPI resources
 * @return      Number of data items transferred
 */
static
uint32_t SPI_GetDataCount(SPI_RESOURCES *spi)
{
  return (spi->xfer->rx_cnt);
}

/**
 * @fn          int32_t SPI_Control(uint32_t control, uint32_t arg, SPI_RESOURCES *spi)
 * @brief       Control SPI Interface.
 * @param[in]   control  Operation
 * @param[in]   arg      Argument of operation (optional)
 * @param[in]   spi      Pointer to SPI resources
 * @return      \ref execution_status
 */
static
int32_t SPI_Control(uint32_t control, uint32_t arg, SPI_RESOURCES *spi)
{
  int32_t br;
  uint32_t mode, val;
  uint32_t cr1, cr2;
  SPI_INFO *info = spi->info;
  SPI_TypeDef *reg = spi->reg;

  mode  = 0U;
  val   = 0U;
  cr1   = 0U;
  cr2   = 0U;

  if ((info->state & SPI_POWERED) == 0U)
    return DRIVER_ERROR;

  if ((control & SPI_CONTROL_Msk) == SPI_ABORT_TRANSFER) {
    cr2 = reg->CR2;

    /* Send abort */
#ifdef SPI_DMA_TX
    if (spi->tx_dma != NULL) {
      /* DMA mode */
      /* TX buffer DMA disable */
      cr2 &= ~SPI_CR2_TXDMAEN;

      /* Abort TX DMA transfer */
      DMA_Abort(spi->tx_dma);
      DMA_WaitAbort(spi->tx_dma);
    }
    else
#endif
    {
      /* Interrupt mode */
      /* Disable TX buffer empty interrupt */
      cr2 &= ~SPI_CR2_TXEIE;
    }

    /* Receive abort */
#ifdef SPI_DMA_RX
    if (spi->rx_dma != NULL) {
      /* DMA mode */
      /* RX buffer DMA disable */
      cr2 &= ~SPI_CR2_RXDMAEN;

      /* Abort RX DMA transfer */
      DMA_Abort(spi->rx_dma);
      DMA_WaitAbort(spi->rx_dma);
    }
    else
#endif
    {
      /* Interrupt mode */
      /* Disable RX buffer not empty interrupt */
      cr2 &= ~SPI_CR2_RXNEIE;
    }

    reg->CR2 = cr2;

    memset((void *)spi->xfer, 0, sizeof(SPI_TRANSFER_INFO));
    info->status.busy = 0U;

    return DRIVER_OK;
  }

  /* Check for busy flag */
  if (info->status.busy) {
    return (DRIVER_ERROR_BUSY);
  }

  switch (control & SPI_CONTROL_Msk) {
    case SPI_MODE_INACTIVE:
      mode |= SPI_MODE_INACTIVE;
      break;

    case SPI_MODE_MASTER:
      mode |= SPI_MODE_MASTER;

      /* Master enabled */
      cr1 |= SPI_CR1_MSTR;
      break;

    case SPI_MODE_SLAVE:
      mode |= SPI_MODE_SLAVE;
      break;

    case SPI_MODE_MASTER_SIMPLEX:
    case SPI_MODE_SLAVE_SIMPLEX:
      return (SPI_ERROR_MODE);

    case SPI_SET_BUS_SPEED:
      /* Set SPI Bus Speed */
      br = CalcPrescalerValue(spi, arg);
      if (br < 0) {
        return (DRIVER_ERROR);
      }

      /* Disable SPI, update prescaler and enable SPI */
      reg->CR1 &= ~SPI_CR1_SPE;
      reg->CR1 = (reg->CR1 & ~SPI_CR1_BR_Msk) | (br << SPI_CR1_BR_Pos);
      reg->CR1 |= SPI_CR1_SPE;
      return (DRIVER_OK);

    case SPI_GET_BUS_SPEED:
      /* Return current bus speed */
      return (int32_t)(RCC_GetPeriphFreq(spi->rcc) >> (((reg->CR1 & SPI_CR1_BR_Msk) >> SPI_CR1_BR_Pos) + 1U));

    case SPI_SET_DEFAULT_TX_VALUE:
      spi->xfer->def_val = (uint16_t)(arg & 0xFFFFU);
      return DRIVER_OK;

    case SPI_CONTROL_SS:
      val = (info->mode & SPI_CONTROL_Msk);
      /* Master modes */
      if (val == SPI_MODE_MASTER) {
        val = info->mode & SPI_SS_MASTER_MODE_Msk;
        /* Check if NSS pin is available and */
        /* software slave select master is selected */
        if ((spi->io.nss != NULL) && (val == SPI_SS_MASTER_SW)) {
          SPI_PIN *io = spi->io.nss;
          /* Set/Clear NSS pin */
          if (arg == SPI_SS_INACTIVE) {
            GPIO_PinWrite(io->port, io->pin, GPIO_PIN_OUT_HIGH);
          }
          else {
            GPIO_PinWrite(io->port, io->pin, GPIO_PIN_OUT_LOW);
          }
          return DRIVER_OK;
        }
        else {
          return DRIVER_ERROR;
        }
      }
      /* Slave modes */
      else if (val == SPI_MODE_SLAVE) {
        val = info->mode & SPI_SS_SLAVE_MODE_Msk;
        /* Check if slave select slave mode is selected */
        if (val == SPI_SS_SLAVE_SW) {
          if (arg == SPI_SS_ACTIVE) {
            reg->CR1 |= SPI_CR1_SSI;
          }
          else {
            reg->CR1 &= ~SPI_CR1_SSI;
          }
          return DRIVER_OK;
        }
        else {
          return DRIVER_ERROR;
        }
      }
      else {
        return DRIVER_ERROR;
      }

    default:
      return DRIVER_ERROR_UNSUPPORTED;
  }

  /* Frame format */
  switch (control & SPI_FRAME_FORMAT_Msk) {
    case SPI_CPOL0_CPHA0:
      break;
    case SPI_CPOL0_CPHA1:
      cr1 |= SPI_CR1_CPHA;
      break;
    case SPI_CPOL1_CPHA0:
      cr1 |= SPI_CR1_CPOL;
      break;
    case SPI_CPOL1_CPHA1:
      cr1 |= SPI_CR1_CPHA | SPI_CR1_CPOL;
      break;
    case SPI_TI_SSI:
      cr1 |= SPI_CR2_FRF;
      break;
    default:
      return SPI_ERROR_FRAME_FORMAT;
  }

