koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/SPI_STM32F7xx.c
  /* Data Bits */
  val = (control & SPI_DATA_BITS_Msk) >> SPI_DATA_BITS_Pos;
  if ((val < 4U) || (val > 16)) {
    return (SPI_ERROR_DATA_BITS);
  }
  if (val <= 8U) {
    cr2 |= SPI_CR2_FRXTH;
  }
  cr2 |= (val - 1U) << SPI_CR2_DS_Pos;

  /* Bit order */
  if ((control & SPI_BIT_ORDER_Msk) == SPI_LSB_MSB) {
    cr1 |= SPI_CR1_LSBFIRST;
  }

  /* Slave select master modes */
  if ((mode & SPI_CONTROL_Msk) == SPI_MODE_MASTER) {
    switch (control & SPI_SS_MASTER_MODE_Msk) {
      case SPI_SS_MASTER_UNUSED:
        if (spi->io.nss != NULL) {
          /* Unconfigure NSS pin */
          PinConfig(spi->io.nss, &SPI_pin_cfg_analog);
        }
        /* Software slave management */
        /* Internal NSS always active, IO value is ignored */
        cr1 |= SPI_CR1_SSM | SPI_CR1_SSI;
        mode |= SPI_SS_MASTER_UNUSED;
        break;

      case SPI_SS_MASTER_HW_INPUT:
        if (spi->io.nss != NULL) {
          /* Configure NSS pin */
          PinConfig(spi->io.nss, &SPI_pin_cfg_af);
        }
        else {
          /* NSS pin is not available */
          return SPI_ERROR_SS_MODE;
        }

        mode |= SPI_SS_MASTER_HW_INPUT;
        break;

      case SPI_SS_MASTER_SW:
        if (spi->io.nss != NULL) {
          /* Configure NSS pin as GPIO output */
          PinConfig(spi->io.nss, &SPI_pin_cfg_out_pp);
          GPIO_PinWrite(spi->io.nss->port, spi->io.nss->pin, GPIO_PIN_OUT_HIGH);

          /* Software slave management */
          cr1 |= SPI_CR1_SSM | SPI_CR1_SSI;

          mode |= SPI_SS_MASTER_SW;
        }
        else {
          /* NSS pin is not available */
          return SPI_ERROR_SS_MODE;
        }
        break;

      case SPI_SS_MASTER_HW_OUTPUT:
        if (spi->io.nss != NULL) {
          /* Configure NSS pin - SPI NSS alternative function */
          PinConfig(spi->io.nss, &SPI_pin_cfg_af);

          /* Slave select output enable */
          cr2 |= SPI_CR2_SSOE;

          mode |= SPI_SS_MASTER_HW_OUTPUT;
        }
        else {
          /* NSS pin is not available */
          return SPI_ERROR_SS_MODE;
        }
        break;
      default:
        return SPI_ERROR_SS_MODE;
    }
  }
  /* Slave select slave modes */
  else if ((mode & SPI_CONTROL_Msk) == SPI_MODE_SLAVE) {
    switch (control & SPI_SS_SLAVE_MODE_Msk) {
      case SPI_SS_SLAVE_HW:
        if (spi->io.nss != NULL) {
          /* Configure NSS pin - SPI NSS alternative function */
          PinConfig(spi->io.nss, &SPI_pin_cfg_af);

          mode |= SPI_SS_SLAVE_HW;
        }
        else {
          /* NSS pin is not available */
          return SPI_ERROR_SS_MODE;
        }
        break;

      case SPI_SS_SLAVE_SW:
        if (spi->io.nss != NULL) {
          /* Unconfigure NSS pin */
          PinConfig(spi->io.nss, &SPI_pin_cfg_analog);
        }
        /* Enable software slave management */
        cr1 |= SPI_CR1_SSM;
        mode |= SPI_SS_SLAVE_SW;
        break;
      default:
        return SPI_ERROR_SS_MODE;
    }
  }

  /* Set SPI Bus Speed */
  if ((mode & SPI_CONTROL_Msk) == SPI_MODE_MASTER) {
    br = CalcPrescalerValue(spi, arg);
    if (br < 0) {
      return DRIVER_ERROR;
    }
    /* Save prescaler value */
    cr1 |= (br << SPI_CR1_BR_Pos);
  }

  info->mode = mode;

  /* Configure registers */
  reg->CR1 &= ~SPI_CR1_SPE;
  reg->CR2 = cr2 | SPI_CR2_ERRIE;
  reg->CR1 = cr1;

  if ((mode & SPI_CONTROL_Msk) == SPI_MODE_INACTIVE) {
    info->state &= ~SPI_CONFIGURED;
  }
  else {
    info->state |= SPI_CONFIGURED;
  }

  /* Enable SPI */
  reg->CR1 |= SPI_CR1_SPE;

  return DRIVER_OK;
}

/**
 * @fn          SPI_STATUS SPI_GetStatus(SPI_RESOURCES *spi)
 * @brief       Get SPI status.
 * @param[in]   spi  Pointer to SPI resources
 * @return      SPI status \ref SPI_STATUS
 */
static
SPI_STATUS SPI_GetStatus(SPI_RESOURCES *spi)
{
  SPI_STATUS status;

  status.busy       = spi->info->status.busy;
  status.data_lost  = spi->info->status.data_lost;
  status.mode_fault = spi->info->status.mode_fault;

  return status;
}

/**
 * @fn          void SPI_IRQHandler(SPI_RESOURCES *spi)
 * @brief       SPI Interrupt handler.
 * @param[in]   spi  Pointer to SPI resources
 */
void SPI_IRQHandler(SPI_RESOURCES *spi)
{
  register uint32_t sr, cr1, cr2;
  uint32_t event;
  bool access_16bit;
  uint32_t value;

  SPI_INFO *info = spi->info;
  SPI_TRANSFER_INFO *xfer = spi->xfer;
  SPI_TypeDef *reg = spi->reg;

  event = 0U;

  /* Save control register 1 */
  cr1 = reg->CR1;
  /* Save control register 2 */
  cr2 = reg->CR2;
  /* Save status register */
  sr = reg->SR;

  access_16bit = ((cr2 & SPI_CR2_DS) >> SPI_CR2_DS_Pos) > 7U;

  if ((sr & (SPI_SR_OVR | SPI_SR_MODF)) != 0U) {
    if ((sr & SPI_SR_OVR) != 0U) {
      /* Read data from data register */
      if (access_16bit) {
        value = *(__IO uint16_t *)&reg->DR;
//        value = (uint16_t)reg->DR;
        if ((xfer->rx_cnt < xfer->num) && (xfer->rx_buf != NULL)) {
          *((uint16_t *)xfer->rx_buf++) = (uint16_t)value;
        }
      }
      else {
        value = *(__IO uint8_t *)&reg->DR;
        if ((xfer->rx_cnt < xfer->num) && (xfer->rx_buf != NULL)) {
          *((uint8_t *)xfer->rx_buf++) = (uint8_t)value;
        }
      }

      xfer->rx_cnt++;
      sr = reg->SR;

      info->status.data_lost = 1U;
      event |= SPI_EVENT_DATA_LOST;
    }

    if ((sr & SPI_SR_MODF) != 0U) {
      /* Mode fault flag is set */
      info->status.mode_fault = 1U;

      /* Write CR1 register to clear MODF flag */
      reg->CR1 = cr1;
      event |= SPI_EVENT_MODE_FAULT;
    }
  }

  if (((sr & SPI_SR_RXNE) != 0U) && ((cr2 & SPI_CR2_RXNEIE) != 0U)) {
    /* Receive Buffer Not Empty */
    if (xfer->rx_cnt < xfer->num) {
      /* Read data from data register */
      if (access_16bit) {
        value = *(__IO uint16_t *)&reg->DR;
        if (xfer->rx_buf != NULL) {
          *((uint16_t *)xfer->rx_buf++) = (uint16_t)value;
        }
      }
      else {
        value = *(__IO uint8_t *)&reg->DR;
        if (xfer->rx_buf != NULL) {
          *((uint8_t *)xfer->rx_buf++) = (uint8_t)value;
        }
      }

      if (++xfer->rx_cnt == xfer->num) {
        /* Disable RX Buffer Not Empty Interrupt */
        cr2 &= ~SPI_CR2_RXNEIE;
        /* Clear busy flag */
        info->status.busy = 0U;
        /* Transfer completed */
        event |= SPI_EVENT_TRANSFER_COMPLETE;
      }
    }
    else {
      /* Unexpected transfer, data lost */
      event |= SPI_EVENT_DATA_LOST;
    }
  }

