koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F7xx/Driver/SPI_STM32F7xx.c
  if (((sr & SPI_SR_TXE) != 0U) && ((cr2 & SPI_CR2_TXEIE) != 0U)) {
    if (xfer->tx_cnt < xfer->num) {
      /* Write data to data register */
      if (access_16bit) {
        if (xfer->tx_buf != NULL) {
          value = *((uint16_t *)xfer->tx_buf++);
        }
        else {
          value = xfer->def_val;
        }
        *(__IO uint16_t *)&reg->DR = (uint16_t)value;
      }
      else {
        if (xfer->tx_buf != NULL) {
          value = *((uint8_t *)xfer->tx_buf++);
        }
        else {
          value = xfer->def_val;
        }
        *(__IO uint8_t *)&reg->DR = (uint8_t)value;
      }

      if (++xfer->tx_cnt == xfer->num) {
        /* All data sent, disable TX Buffer Empty Interrupt */
        cr2 &= ~SPI_CR2_TXEIE;
      }
    }
    else {
      /* Unexpected transfer, data lost */
      event |= SPI_EVENT_DATA_LOST;
    }
  }

  reg->CR2 = cr2;

  /* Send event */
  if ((event != 0U) && ((info->cb_event != NULL))) {
    info->cb_event(event);
  }
}

#ifdef SPI_DMA_TX
static
void SPIx_TX_DMA_Callback(uint32_t event, const void *param)
{
  SPI_RESOURCES *spi = param;

  if (event & DMA_EVENT_TRANSFER_COMPLETE) {
    /* TX buffer DMA disable */
    spi->reg->CR2 &= ~SPI_CR2_TXDMAEN;
    spi->xfer->tx_cnt = spi->xfer->num;
  }
}
#endif  /* SPI_DMA_TX */

#ifdef SPI_DMA_RX
static
void SPIx_RX_DMA_Callback(uint32_t event, const void *param)
{
  SPI_RESOURCES *spi = param;
  SPI_INFO *info = spi->info;

  if (event & DMA_EVENT_TRANSFER_COMPLETE) {
    /* RX Buffer DMA disable */
    spi->reg->CR2 |= SPI_CR2_RXDMAEN;

    spi->xfer->rx_cnt = spi->xfer->num;
    info->status.busy = 0U;

    if (info->cb_event != NULL)
      info->cb_event(SPI_EVENT_TRANSFER_COMPLETE);
  }
}
#endif  /* SPI_DMA_RX */

#if defined(USE_SPI1)
  SPIx_EXPORT_DRIVER(1);
#endif  /* USE_SPI1 */

#if defined(USE_SPI2)
  SPIx_EXPORT_DRIVER(2);
#endif  /* USE_SPI2 */

#if defined(USE_SPI3)
  SPIx_EXPORT_DRIVER(3);
#endif  /* USE_SPI3 */

#if defined(USE_SPI4)
  SPIx_EXPORT_DRIVER(4);
#endif  /* USE_SPI4 */

#if defined(USE_SPI5)
  SPIx_EXPORT_DRIVER(5);
#endif  /* USE_SPI5 */

#if defined(USE_SPI6)
  SPIx_EXPORT_DRIVER(6);
#endif  /* USE_SPI6 */

#endif /* defined(USE_SPI1) || defined(USE_SPI2) || defined(USE_SPI3) ...     */

/* ----------------------------- End of file ---------------------------------*/
